<font color="skyblue">The first program in a Jupyter notebook</font>

In [1]:

# load the excel file in the directory data/ and print the first 5 rows
import pandas as pd
import numpy as np

df = pd.read_excel('data/city_quality.xlsx')
df.head()

,climate,housing,health,crime,transportation,education,arts,recreation,economics
0,521,6200,237,923,4031,2757,996,1405,7633
1,575,8138,1656,886,4883,2438,5564,2632,4350
2,468,7339,618,970,2531,2560,237,859,5250
3,476,7908,1431,610,6883,3399,4655,1617,5864
4,659,8393,1853,1483,6558,3026,4496,2612,5727